AGENDA -*- mode: org -*-

#+STARTUP: overview

#+TITLE: Do your homework, nerd


* Creative Engineering
* Humanities
** TODO [#B] Third Independent Reading Project
DEADLINE: <2022-02-18 Fri> 

* Spanish
** TODO-URGENT [#A] Spanish Voces Exit Ticket (by midnight)
DEADLINE: <2022-02-09 WED>

* Physics
*** DONE [#A] Packet (1/13)
CLOSED: [2022-01-13 Thu 16:13]
:LOGBOOK:
CLOCK: [2022-01-13 Thu 15:59]--[2022-01-13 Thu 16:13] =>  0:14
:END:

* Composition
*** DONE [#C] Outline packet
CLOSED: [2022-02-08 Tue 16:15]
*** DONE [#A] Thesis
CLOSED: [2022-02-08 Tue 16:15]
** VERIFY [#A] Summative Essay Paragraph 1
CLOSED: [2022-02-08 Tue 21:43] DEADLINE: <2022-02-09 Wed>
:LOGBOOK:
CLOCK: [2022-02-08 Tue 20:48]--[2022-02-08 Tue 21:35] =>  0:47
:END:
** VERIFY [#A] Summative Essay Paragraph 2
CLOSED: [2022-02-09 Wed 21:52] DEADLINE: <2022-02-10 Thu>
:LOGBOOK:
CLOCK: [2022-02-09 Wed 21:27]--[2022-02-09 Wed 21:52] =>  0:25
:END:

* Math
*** DeltaMath



#  LocalWords:  Summative

